rkz/extension/Documents/ДвижениеПродукцииИМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДвижениеПродукцииИМатериалов</Name>
		</Properties>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПризнакСертификации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Признак</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВидЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипОбшивкиБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесОбшивки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесБарабана</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПрежнийНомерТары</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Намотки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереченьДлинНаБарабане</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

rkz/extension/Documents/ДвижениеПродукцииИМатериалов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&После("ДобавитьКомандыПечати")
Процедура бит_ДобавитьКомандыПечати(КомандыПечати)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] +        
	
	СписокХозяйственныхОпераций = Новый Массив();
	СписокХозяйственныхОпераций.Добавить(Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	
	//Задача 1.1
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ДокументОКачестве";
	КомандаПечати.Представление = НСтр("ru = '(бит) Документ о качестве'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	Документы.ДвижениеПродукцииИМатериалов.ДобавитьУсловиеВидимостиКомандыПоХозяйственнойОперации(КомандаПечати, СписокХозяйственныхОпераций);
	
	//Задача 1.2
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ДокументОКачествеМОС";
	КомандаПечати.Представление = НСтр("ru = '(бит) Документ о качестве МОС'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	Документы.ДвижениеПродукцииИМатериалов.ДобавитьУсловиеВидимостиКомандыПоХозяйственнойОперации(КомандаПечати, СписокХозяйственныхОпераций);
	
	//Задача 1.3
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ДокументОКачествеСреднееНапряжение";
	КомандаПечати.Представление = НСтр("ru = '(бит) Документ о качестве среднее напряжение'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	Документы.ДвижениеПродукцииИМатериалов.ДобавитьУсловиеВидимостиКомандыПоХозяйственнойОперации(КомандаПечати, СписокХозяйственныхОпераций);
	
	//Задача 4
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ПаспортКачества";
	КомандаПечати.Представление = НСтр("ru = '(бит) Паспорт качества'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:42:41] +        
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_НакладнаяНаСдачуГотовойПродукцииБарабаны";
	КомандаПечати.Представление = НСтр("ru = '(бит) Накладная на сдачу готовой продукции (барабаны)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_НакладнаяНаСдачуГотовойПродукцииБухты";
	КомандаПечати.Представление = НСтр("ru = '(бит) Накладная на сдачу готовой продукции (бухты)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:42:41] -
КонецПроцедуры

&После("Печать")
Процедура бит_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] +        
	
	//Задача 1.1
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_ДокументОКачестве");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Документ о качестве'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_ДокументОКачестве", 
		Заголовок,
		бит_СформироватьПечатнуюФормуДокументОКачестве(МассивОбъектов),
		,
		"Документ.ДвижениеПродукцииИМатериалов.бит_ПФ_MXL_ДокументОКачестве");
		
	КонецЕсли;  

	//Задача 1.2
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_ДокументОКачествеМОС");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Документ о качестве'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_ДокументОКачествеМОС", 
		Заголовок,
		бит_СформироватьПечатнуюФормуДокументОКачествеМОС(МассивОбъектов),
		,
		"Документ.ДвижениеПродукцииИМатериалов.бит_ПФ_MXL_ДокументОКачествеМОС"); 
				
	КонецЕсли;
	
	//Задача 1.3
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_ДокументОКачествеСреднееНапряжение");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Документ о качестве'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_ДокументОКачествеСреднееНапряжение", 
		Заголовок,
		бит_СформироватьПечатнуюФормуДокументОКачествеСреднееНапряжение(МассивОбъектов),
		,
		"Документ.ДвижениеПродукцииИМатериалов.бит_ПФ_MXL_ДокументОКачествеСреднееНапряжение");
				
	КонецЕсли;

	//Задача 4
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_ПаспортКачества");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Документ о качестве'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_ПаспортКачества", 
		Заголовок,
		бит_СформироватьПечатнуюФормуПаспортКачества(МассивОбъектов),
		,
		"Документ.ДвижениеПродукцииИМатериалов.бит_ПФ_MXL_ПаспортКачества");
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] -
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:46:29] +        
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_НакладнаяНаСдачуГотовойПродукцииБарабаны");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Накладная на сдачу готовой продукции (барабаны)'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_НакладнаяНаСдачуГотовойПродукцииБарабаны", 
		Заголовок,
		бит_СформироватьПечатнуюФормуНакладнаяНаСдачуГотовойПродукцииБарабаны(МассивОбъектов),
		,
		"Документ.ДвижениеПродукцииИМатериалов.бит_ПФ_MXL_ПаспортКачества");
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_НакладнаяНаСдачуГотовойПродукцииБухты");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Накладная на сдачу готовой продукции (бухты)'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_НакладнаяНаСдачуГотовойПродукцииБухты", 
		Заголовок,
		бит_СформироватьПечатнуюФормуНакладнаяНаСдачуГотовойПродукцииБухты(МассивОбъектов),
		,
		"Документ.ДвижениеПродукцииИМатериалов.бит_ПФ_MXL_ПаспортКачества");
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:46:29] -
КонецПроцедуры

Функция ПолучитьГОСТ(Номенклатура)
	
	ГОСТ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Признак КАК бит_Признак,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации КАК бит_ПризнакСертификации,
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК бит_Значение
		|ИЗ
		|	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
		|ГДЕ
		|	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &бит_Номенклатура
		|	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак.Код = ""GOST""";
	
	Запрос.УстановитьПараметр("бит_Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ГОСТ = ГОСТ + ?(ЗначениеЗаполнено(ГОСТ), ", ", "") + ВыборкаДетальныеЗаписи.бит_Значение.Наименование;
	КонецЦикла;
	
	Возврат ГОСТ;
	
КонецФункции

Функция ПолучитьПунктыСтандарта(Номенклатура, ПоказателиПроверки)
	
    Пункты = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ПунктыНДКПоказателямПроверок.бит_Номенклатура КАК бит_Номенклатура,
		|	бит_ПунктыНДКПоказателямПроверок.бит_НормативныйДокумент КАК бит_НормативныйДокумент,
		|	бит_ПунктыНДКПоказателямПроверок.бит_ПунктНормативногоДокумента КАК бит_ПунктНормативногоДокумента
		|ИЗ
		|	РегистрСведений.бит_ПунктыНДКПоказателямПроверок КАК бит_ПунктыНДКПоказателямПроверок
		|ГДЕ
		|	бит_ПунктыНДКПоказателямПроверок.бит_Номенклатура = &бит_Номенклатура
		|	И бит_ПунктыНДКПоказателямПроверок.бит_ПоказательПроверкиНоменклатуры = &бит_ПоказательПроверкиНоменклатуры
		|ИТОГИ ПО
		|	бит_Номенклатура,
		|	бит_НормативныйДокумент";
	
	Запрос.УстановитьПараметр("бит_Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("бит_ПоказательПроверкиНоменклатуры", ПоказателиПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборкабит_Номенклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборкабит_Номенклатура.Следующий() Цикл
		// Вставить обработку выборки Выборкабит_Номенклатура
	
		Выборкабит_НормативныйДокумент = Выборкабит_Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока Выборкабит_НормативныйДокумент.Следующий() Цикл
			
			
			Пункты = Пункты + Выборкабит_НормативныйДокумент.бит_НормативныйДокумент + " ";
			
			ВыборкаДетальныеЗаписи = Выборкабит_НормативныйДокумент.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Пункты = Пункты + 
					?(Выборкабит_НормативныйДокумент.бит_НормативныйДокумент = ВыборкаДетальныеЗаписи.бит_ПунктНормативногоДокумента
						, ""
						, ВыборкаДетальныеЗаписи.бит_ПунктНормативногоДокумента)+ " ";
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Пункты;
	
КонецФункции

Функция бит_СформироватьПечатнуюФормуДокументОКачестве(МассивОбъектов)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] +        
	
	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;	
	ТабличныйДокумент.КлючПараметровПечати = "бит_ДокументОКачестве";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_ДокументОКачестве");
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата КАК Дата,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Серия КАК Серия,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Марка,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок КАК Длина,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер КАК НомерБарабана,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.бит_ТипБарабана КАК Тип,
		|	Адрес.Представление КАК Адрес,
		|	Телефон.Представление КАК Телефон,
		|	Email.Представление КАК Email,
		|	Факс.Представление КАК Факс
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Адрес
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Адрес.Ссылка
		|			И (Адрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (Адрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Телефон
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Телефон.Ссылка
		|			И (Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Email
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Email.Ссылка
		|			И (Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (Email.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Факс
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Факс.Ссылка
		|			И (Факс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
		|			И (Факс.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации))
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвижениеПродукцииИМатериаловТовары.Серия,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер,
		|	Адрес.Представление,
		|	Телефон.Представление,
		|	Email.Представление,
		|	Факс.Представление,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.бит_ТипБарабана";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементМассива);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ГОСТ = ПолучитьГОСТ(ВыборкаДетальныеЗаписи.Номенклатура);
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьШапка.Параметры.ГОСТ = ГОСТ; 
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			
			н = 1;
			
			Для Каждого СтрокаПоказатель Из ВыборкаДетальныеЗаписи.Номенклатура.бит_ПоказателиПроверокНоменклатуры Цикл 
				
				ОбластьСтрокаТаблицы.Параметры.Нпп = н;
				
				ОбластьСтрокаТаблицы.Параметры.Наименование = Строка(СтрокаПоказатель.бит_ПоказателиПроверки) + " " + Строка(СтрокаПоказатель.бит_ЕдиницыИзмерения);
				ОбластьСтрокаТаблицы.Параметры.ПунктСтандарта = ПолучитьПунктыСтандарта(ВыборкаДетальныеЗаписи.Номенклатура, СтрокаПоказатель.бит_ПоказателиПроверки);
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
				
				н = н + 1;
				
			КонецЦикла;
			
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.ГОСТ = ГОСТ;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] -
	
КонецФункции

Функция бит_СформироватьПечатнуюФормуДокументОКачествеМОС(МассивОбъектов)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] +        

   	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_ДокументОКачествеМОС";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_ДокументОКачествеМОС");
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата КАК Дата,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Серия КАК Серия,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Марка,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок КАК Длина,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер КАК НомерБарабана,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.бит_ТипБарабана КАК Тип,
		|	Адрес.Представление КАК Адрес,
		|	Телефон.Представление КАК Телефон,
		|	Email.Представление КАК Email,
		|	Факс.Представление КАК Факс
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Адрес
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Адрес.Ссылка
		|			И (Адрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (Адрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Телефон
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Телефон.Ссылка
		|			И (Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Email
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Email.Ссылка
		|			И (Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (Email.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Факс
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Факс.Ссылка
		|			И (Факс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
		|			И (Факс.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации))
		
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвижениеПродукцииИМатериаловТовары.Серия,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер,
		|	Адрес.Представление,
		|	Телефон.Представление,
		|	Email.Представление,
		|	Факс.Представление,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.бит_ТипБарабана";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементМассива);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ГОСТ = ПолучитьГОСТ(ВыборкаДетальныеЗаписи.Номенклатура);
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьШапка.Параметры.ГОСТ = ГОСТ; 
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатурабит_ПоказателиПроверокНоменклатуры.бит_ПоказателиПроверки.Родитель КАК Родитель,
			|	Номенклатурабит_ПоказателиПроверокНоменклатуры.бит_ПоказателиПроверки КАК бит_ПоказателиПроверки,
			|	Номенклатурабит_ПоказателиПроверокНоменклатуры.бит_Значение КАК бит_Значение,
			|	Номенклатурабит_ПоказателиПроверокНоменклатуры.бит_ЗначениеИзСписка КАК бит_ЗначениеИзСписка,
			|	Номенклатурабит_ПоказателиПроверокНоменклатуры.бит_ЕдиницыИзмерения КАК бит_ЕдиницыИзмерения
			|ИЗ
			|	Справочник.Номенклатура.бит_ПоказателиПроверокНоменклатуры КАК Номенклатурабит_ПоказателиПроверокНоменклатуры
			|ГДЕ
			|	Номенклатурабит_ПоказателиПроверокНоменклатуры.Ссылка = &Номенклатура
			|ИТОГИ ПО
			|	Родитель";
			
			Запрос.УстановитьПараметр("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			
			ВыборкаГруппировка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаГруппировка.Следующий() Цикл
				
				н = 1;
				ОбластьГруппировкаТаблицы = Макет.ПолучитьОбласть("ГруппировкаТаблицы");
				ОбластьГруппировкаТаблицы.Параметры.Группировка = ВыборкаГруппировка.Родитель;
				
				ТабличныйДокумент.Вывести(ОбластьГруппировкаТаблицы);
				
				ВыборкаПоказатели = ВыборкаГруппировка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоказатели.Следующий() Цикл
					
					
					ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
					ОбластьСтрокаТаблицы.Параметры.Нпп = н;
					
					ОбластьСтрокаТаблицы.Параметры.Наименование = Строка(ВыборкаПоказатели.бит_ПоказателиПроверки) + " " + Строка(ВыборкаПоказатели.бит_ЕдиницыИзмерения);
					ОбластьСтрокаТаблицы.Параметры.ПунктСтандарта = ПолучитьПунктыСтандарта(ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаПоказатели.бит_ПоказателиПроверки);
					
					ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
					
					н = н + 1;
						
				КонецЦикла;
				
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Номер КАК СертификатНоменклатурыНомер,
			|	ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаНачалаСрокаДействия КАК ДатаНачалаСрокаДействия,
			|	ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаОкончанияСрокаДействия КАК ДатаОкончанияСрокаДействия
			|ИЗ
			|	РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатовНоменклатуры
			|ГДЕ
			|	ОбластиДействияСертификатовНоменклатуры.Номенклатура = &Номенклатура
			|	И (ОбластиДействияСертификатовНоменклатуры.Серия = &Серия
			|			ИЛИ ОбластиДействияСертификатовНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
			|	И ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Действующий)
			|	И ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ТипСертификата = ""Декларация о соответствии""
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаНачалаСрокаДействия УБЫВ";
			
			Запрос.УстановитьПараметр("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			Запрос.УстановитьПараметр("Серия", ВыборкаДетальныеЗаписи.Серия);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			СертификатНоменклатуры = РезультатЗапроса.Выбрать();
			
			ДекларацияСоотвтетствияИСрокДействия = "";
			
			Пока СертификатНоменклатуры.Следующий() Цикл
				ДекларацияСоотвтетствияИСрокДействия = "№ " 
					+ Строка(СертификатНоменклатуры.СертификатНоменклатурыНомер) 
					+ " срок действия с " + Строка(Формат(СертификатНоменклатуры.ДатаНачалаСрокаДействия, "ДФ=dd.MM.yyyy"))
					+ " по " + Строка(Формат(СертификатНоменклатуры.ДатаОкончанияСрокаДействия, "ДФ=dd.MM.yyyy"));
			КонецЦикла;
			
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.ГОСТ = ГОСТ;
			ОбластьПодвал.Параметры.ДекларацияСоотвтетствияИСрокДействия = ДекларацияСоотвтетствияИСрокДействия;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			                                                                   
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;

	// }}ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] -
	
КонецФункции

Функция бит_СформироватьПечатнуюФормуДокументОКачествеСреднееНапряжение(МассивОбъектов)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] +        

    УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_ДокументОКачествеСреднееНапряжение";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_ДокументОКачествеСреднееНапряжение");
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата КАК Дата,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Серия КАК Серия,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Марка,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок КАК Длина,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер КАК НомерБарабана,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.бит_ТипБарабана КАК Тип,
		|	Адрес.Представление КАК Адрес,
		|	Телефон.Представление КАК Телефон,
		|	Email.Представление КАК Email,
		|	Факс.Представление КАК Факс
		
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Адрес
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Адрес.Ссылка
		|			И (Адрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (Адрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Телефон
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Телефон.Ссылка
		|			И (Телефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Email
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Email.Ссылка
		|			И (Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (Email.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК Факс
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка.Организация = Факс.Ссылка
		|			И (Факс.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Факс))
		|			И (Факс.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФаксОрганизации))
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвижениеПродукцииИМатериаловТовары.Серия,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер,
		|	Адрес.Представление,
		|	Телефон.Представление,
		|	Email.Представление,
		|	Факс.Представление,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.бит_ТипБарабана";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементМассива);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ГОСТ = ПолучитьГОСТ(ВыборкаДетальныеЗаписи.Номенклатура);
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьШапка.Параметры.ГОСТ = ГОСТ; 
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
			
			н = 1;
			
			Для Каждого СтрокаПоказатель Из ВыборкаДетальныеЗаписи.Номенклатура.бит_ПоказателиПроверокНоменклатуры Цикл 
				
				ОбластьСтрокаТаблицы.Параметры.Нпп = н;
				
				ОбластьСтрокаТаблицы.Параметры.Наименование = Строка(СтрокаПоказатель.бит_ПоказателиПроверки) + " " + Строка(СтрокаПоказатель.бит_ЕдиницыИзмерения);
				ОбластьСтрокаТаблицы.Параметры.ПунктСтандарта = ПолучитьПунктыСтандарта(ВыборкаДетальныеЗаписи.Номенклатура, СтрокаПоказатель.бит_ПоказателиПроверки);
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
				
				н = н + 1;
				
			КонецЦикла;
			
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.ГОСТ = ГОСТ;
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;

	// }}ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] -
	
КонецФункции

Функция бит_СформироватьПечатнуюФормуПаспортКачества(МассивОбъектов)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ9.5] [ASHolyavko@1cbit.ru] [30.05.2025] +        

    УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_ПаспортКачества";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_ПаспортКачества");
	
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Серия КАК Серия,
		|	ДвижениеПродукцииИМатериаловТовары.КоличествоУпаковок КАК Длина,
		|	ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Серия.бит_Партия КАК СТРОКА(255)) КАК НомерПартии,
		|	ДвижениеПродукцииИМатериаловТовары.Серия.Номер КАК НомерБарабана,
		|	RAZMER.бит_Значение КАК RAZMER,
		|	КонтрагентыКонтактнаяИнформация.Ссылка.НаименованиеПолное КАК Контрагент,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Адрес
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК RAZMER
		|		ПО ДвижениеПродукцииИМатериаловТовары.Номенклатура = RAZMER.бит_Номенклатура
		|			И (RAZMER.бит_Признак.Код = ""RAZMER"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ПО (ДвижениеПродукцииИМатериаловТовары.Распоряжение.Распоряжение.ДокументОснование.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
		|				И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|				И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
		|	И ДвижениеПродукцииИМатериаловТовары.Номенклатура.ВидНоменклатуры.Наименование <> ""КАБЕЛИ СУДОВЫЕ (МОРСКИЕ)""
		|ИТОГИ ПО
		|	Контрагент,
		|	Номенклатура,
		|	НомерПартии";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементМассива);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		НазначениеИАдрес = "";
		
		Пока ВыборкаКонтрагент.Следующий() Цикл
			
			ВыборкаНоменклатура = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
									
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				ВыборкаПартия = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПартия.Следующий() Цикл
					
					ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
					ОбластьЗаголовок.Параметры.Заполнить(ВыборкаПартия);
					ОбластьЗаголовок.Параметры.Марка = ВыборкаПартия.Номенклатура.Марка;
					ТабличныйДокумент.Вывести(ОбластьЗаголовок);
					
					Длина = 0;																																						
					
					ВыборкаДетальныеЗаписи = ВыборкаПартия.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						НазначениеИАдрес = Строка(ВыборкаДетальныеЗаписи.Контрагент) + " " + Строка(ВыборкаДетальныеЗаписи.Адрес);
						
						ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
						ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
						//Длина = Длина + ВыборкаДетальныеЗаписи.Длина
						ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
					КонецЦикла;
					
				КонецЦикла;
				
				ГОСТ = ПолучитьГОСТ(ВыборкаНоменклатура.Номенклатура);
				
				ОбластьТехническиеТребования = Макет.ПолучитьОбласть("ТехническиеТребования"); 
				ОбластьТехническиеТребования.Параметры.ГОСТ = ГОСТ;
				
				ОбластьТехническиеТребования.Параметры.НазначениеИАдрес = НазначениеИАдрес;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Ном.Ссылка КАК Ссылка,
				|	SROK_GARAN.бит_Значение КАК SROK_GARAN,
				|	SROK_SL.бит_Значение КАК SROK_SL,
				|	SROK_SOHR.бит_Значение КАК SROK_SOHR
				|ИЗ
				|	Справочник.Номенклатура КАК Ном
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК SROK_SOHR
				|		ПО (Ном.Ссылка = SROK_SOHR.бит_Номенклатура
				|				И SROK_SOHR.бит_Признак.Код = ""SROK_SOHR"")
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК SROK_SL
				|		ПО (Ном.Ссылка = SROK_SL.бит_Номенклатура
				|				И SROK_SL.бит_Признак.Код = ""SROK_SL"")
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК SROK_GARAN
				|		ПО (Ном.Ссылка = SROK_GARAN.бит_Номенклатура
				|				И SROK_GARAN.бит_Признак.Код = ""SROK_GARAN"")
				|ГДЕ
				|	Ном.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ВыборкаНоменклатура.Номенклатура);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписиПодвал = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписиПодвал.Следующий() Цикл
					ОбластьТехническиеТребования.Параметры.Заполнить(ВыборкаДетальныеЗаписиПодвал);
				КонецЦикла;
				
				ТабличныйДокумент.Вывести(ОбластьТехническиеТребования);
				
				ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЦикла;	
			
		КонецЦикла;
				
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция бит_СформироватьПечатнуюФормуНакладнаяНаСдачуГотовойПродукцииБарабаны(МассивОбъектов)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:51:40] +        
	УстановитьПривилегированныйРежим(Истина);  
	
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_НакладнаяНаСдачуГотовойПродукцииБарабаны";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_НакладнаяНаСдачуГотовойПродукцииБарабаны");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаОрганизацияАдрес = Макет.ПолучитьОбласть("СтрокаОрганизацияАдрес");  
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");  
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Первый = Истина;
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		Если Первый Тогда
			Первый = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Сведения = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЭлементМассива.Организация, ЭлементМассива.Дата);
		
		СП = Новый Структура;
	    СП.Вставить("СокращенноеНаименованиеОрганизации", Сведения.СокращенноеНаименование);
		СП.Вставить("НомерДокумента", ЭлементМассива.Номер);
		СП.Вставить("Отправитель", ЭлементМассива.Отправитель);
		СП.Вставить("ДатаПередачи", Формат(ЭлементМассива.Дата, "ДФ=dd.MM.yyyy"));
		СП.Вставить("ФактическийАдресОрганизации", Сведения.ФактическийАдрес);
		
		ОбластьШапка.Параметры.Заполнить(СП);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрокаОрганизацияАдрес.Параметры.Заполнить(СП);
		ТабличныйДокумент.Вывести(ОбластьСтрокаОрганизацияАдрес);
		
		КоллекцияДанных = ПолучитьДанныеТЧ(ЭлементМассива);              
		
		СП = Новый Структура;
		СП.Вставить("СуммаКолВо"	, КоллекцияДанных.Итог("КолВоПрод"));
		
		Для каждого стр из КоллекцияДанных Цикл
			ОбластьСтрока.Параметры.Заполнить(стр); 
			сч = 1;                 
			КолВоПрод = Строка(стр.КолВоПрод);
			Если ЗначениеЗаполнено(стр.Серия) Тогда
				Для каждого намотка из стр.Серия.бит_ПереченьДлинНаБарабане Цикл
					КолВоПрод = КолВоПрод + Символы.ПС + Символы.ПС + "N" + сч + "(" + намотка.Длина + ")"; 
					сч = сч + 1;
				КонецЦикла;             
			КонецЕсли;
			ОбластьСтрока.Параметры.КолВоПрод = КолВоПрод;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		СП.Вставить("КоличествоМеди", КоллекцияДанных.Итог("КоличествоМеди"));
		СП.Вставить("КолВоАлюминия"	, КоллекцияДанных.Итог("КолВоАлюминия"));
		
		ОбластьПодвал.Параметры.Заполнить(СП);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
						
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:51:40] -
КонецФункции

Функция ПолучитьДанныеТЧ(ЭлементМассива)
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("НаименованиеИзделия");
	//ТЗ.Колонки.Добавить("АртикулИзделия");
	//ТЗ.Колонки.Добавить("НаименованиеТары");
	//ТЗ.Колонки.Добавить("НаименованиеОбшивки");
	//ТЗ.Колонки.Добавить("АртикулТары");
	//ТЗ.Колонки.Добавить("КолВоПрод");
	//ТЗ.Колонки.Добавить("ЕДН");
	//ТЗ.Колонки.Добавить("ЕДТ");
	//ТЗ.Колонки.Добавить("Цвет");
	//ТЗ.Колонки.Добавить("НомерТары");
	//ТЗ.Колонки.Добавить("ЗаказКлиента");
	//ТЗ.Колонки.Добавить("НомерПартии");
	//ТЗ.Колонки.Добавить("Брутто");
	//ТЗ.Колонки.Добавить("ВидЗак");
	//ТЗ.Колонки.Добавить("КоличествоМеди");  
	//ТЗ.Колонки.Добавить("КолВоАлюминия");
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_ЗначенияПоУмолчаниюЗначения.Значение КАК Значение
	                      |ПОМЕСТИТЬ втПризнакМедь
	                      |ИЗ
	                      |	Справочник.бит_ЗначенияПоУмолчанию.Значения КАК бит_ЗначенияПоУмолчаниюЗначения
	                      |ГДЕ
	                      |	бит_ЗначенияПоУмолчаниюЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_ЗначенияПоУмолчанию.ПризнакМедь)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_ЗначенияПоУмолчаниюЗначения.Значение КАК Значение
	                      |ПОМЕСТИТЬ втПризнакАлюминий
	                      |ИЗ
	                      |	Справочник.бит_ЗначенияПоУмолчанию.Значения КАК бит_ЗначенияПоУмолчаниюЗначения
	                      |ГДЕ
	                      |	бит_ЗначенияПоУмолчаниюЗначения.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_ЗначенияПоУмолчанию.ПризнакАлюминий)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК НаименованиеИзделия,
	                      |	ДвижениеПродукцииИМатериаловТовары.Номенклатура.Артикул КАК АртикулИзделия,
	                      |	ДвижениеПродукцииИМатериаловТовары.Количество КАК КолВоПрод,
	                      |	ВЫБОР
	                      |		КОГДА ДвижениеПродукцииИМатериаловТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА ДвижениеПродукцииИМатериаловТовары.Номенклатура.ЕдиницаИзмерения
	                      |		ИНАЧЕ ДвижениеПродукцииИМатериаловТовары.Упаковка
	                      |	КОНЕЦ КАК ЕДН,
	                      |	СерииНоменклатуры.бит_ТипБарабана КАК НаименованиеТары,
	                      |	СерииНоменклатуры.бит_ТипБарабана.Артикул КАК АртикулТары,
	                      |	СерииНоменклатуры.бит_ТипБарабана.ЕдиницаИзмерения КАК ЕДТ,
	                      |	СерииНоменклатуры.бит_ТипОбшивкиБарабана КАК НаименованиеОбшивки,
	                      |	СерииНоменклатуры.Наименование КАК НомерТары,
	                      |	ДвижениеПродукцииИМатериаловТовары.Назначение.Заказ.Номер КАК ЗаказКлиента,
	                      |	СерииНоменклатуры.бит_Партия КАК НомерПартии,
	                      |	СерииНоменклатуры.бит_Брутто КАК Брутто,
	                      |	СерииНоменклатуры.бит_ВидЗаказа КАК ВидЗак,
	                      |	СерииНоменклатуры.Ссылка КАК Серия,
	                      |	СерииНоменклатуры.бит_Цвет КАК Цвет
	                      |ПОМЕСТИТЬ База
	                      |ИЗ
	                      |	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	                      |		ПО ДвижениеПродукцииИМатериаловТовары.Серия = СерииНоменклатуры.Ссылка
	                      |ГДЕ
	                      |	ДвижениеПродукцииИМатериаловТовары.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ВЫРАЗИТЬ(бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК ЧИСЛО(15, 8))) КАК бит_Значение,
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура
	                      |ПОМЕСТИТЬ втКоэффициентыМедь
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПризнакМедь КАК втПризнакМедь
	                      |		ПО бит_ЗначенияПризнаковНоменклатуры.бит_Признак = втПризнакМедь.Значение
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура В
	                      |			(ВЫБРАТЬ
	                      |				база.НаименованиеИзделия
	                      |			ИЗ
	                      |				база)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ВЫРАЗИТЬ(бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК ЧИСЛО(15, 8))) КАК бит_Значение,
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура КАК бит_Номенклатура
	                      |ПОМЕСТИТЬ втКоэффициентыАлюминий
	                      |ИЗ
	                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПризнакАлюминий КАК втПризнакАлюминий
	                      |		ПО бит_ЗначенияПризнаковНоменклатуры.бит_Признак = втПризнакАлюминий.Значение
	                      |ГДЕ
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура В
	                      |			(ВЫБРАТЬ
	                      |				база.НаименованиеИзделия
	                      |			ИЗ
	                      |				база)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	База.НаименованиеИзделия КАК НаименованиеИзделия,
	                      |	База.АртикулИзделия КАК АртикулИзделия,
	                      |	База.КолВоПрод КАК КолВоПрод,
	                      |	База.ЕДН КАК ЕДН,
	                      |	База.НаименованиеТары КАК НаименованиеТары,
	                      |	База.АртикулТары КАК АртикулТары,
	                      |	База.ЕДТ КАК ЕДТ,
	                      |	База.НаименованиеОбшивки КАК НаименованиеОбшивки,
	                      |	База.НомерТары КАК НомерТары,
	                      |	База.ЗаказКлиента КАК ЗаказКлиента,
	                      |	База.НомерПартии КАК НомерПартии,
	                      |	База.Брутто КАК Брутто,
	                      |	База.ВидЗак КАК ВидЗак,
	                      |	ЕСТЬNULL(втКоэффициентыАлюминий.бит_Значение, 0) * База.КолВоПрод КАК КолВоАлюминия,
	                      |	ЕСТЬNULL(втКоэффициентыМедь.бит_Значение, 0) * База.КолВоПрод КАК КоличествоМеди,
	                      |	База.Серия КАК Серия,
	                      |	База.Цвет КАК Цвет
	                      |ИЗ
	                      |	База КАК База
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втКоэффициентыМедь КАК втКоэффициентыМедь
	                      |		ПО База.НаименованиеИзделия = втКоэффициентыМедь.бит_Номенклатура
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втКоэффициентыАлюминий КАК втКоэффициентыАлюминий
	                      |		ПО База.НаименованиеИзделия = втКоэффициентыАлюминий.бит_Номенклатура");
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	нов = ТЗ.Добавить();   
	//	ЗаполнитьЗначенияСвойств(нов, Выборка);
	//КонецЦикла;
	Запрос.УстановитьПараметр("Ссылка", ЭлементМассива );
    ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
	
КонецФункции                            

Функция бит_СформироватьПечатнуюФормуНакладнаяНаСдачуГотовойПродукцииБухты(МассивОбъектов)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:51:40] +        
	УстановитьПривилегированныйРежим(Истина);  
	
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.КлючПараметровПечати = "бит_НакладнаяНаСдачуГотовойПродукцииБухты";
	
	Макет = ПолучитьМакет("бит_ПФ_MXL_НакладнаяНаСдачуГотовойПродукцииБухты");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаОрганизацияАдрес = Макет.ПолучитьОбласть("СтрокаОрганизацияАдрес");  
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");  
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Первый = Истина;
	Для Каждого ЭлементМассива Из МассивОбъектов Цикл
		Если Первый Тогда
			Первый = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Сведения = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ЭлементМассива.Организация, ЭлементМассива.Дата);
		
		СП = Новый Структура;
	    СП.Вставить("СокращенноеНаименованиеОрганизации", Сведения.СокращенноеНаименование);
		СП.Вставить("НомерДокумента", ЭлементМассива.Номер);
		СП.Вставить("Отправитель", ЭлементМассива.Отправитель);
		СП.Вставить("ДатаПередачи", Формат(ЭлементМассива.Дата, "ДФ=dd.MM.yyyy"));
		СП.Вставить("ФактическийАдресОрганизации", Сведения.ФактическийАдрес);
		
		ОбластьШапка.Параметры.Заполнить(СП);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ОбластьСтрокаОрганизацияАдрес.Параметры.Заполнить(СП);
		ТабличныйДокумент.Вывести(ОбластьСтрокаОрганизацияАдрес);
		
		ВсегоНамоток = 0;
		КоллекцияДанных = ПолучитьДанныеТЧ(ЭлементМассива);
		СППодвал = Новый Структура;
		СП.Вставить("СуммаКолВо"	, КоллекцияДанных.Итог("КолВоПрод"));
		
		Для каждого стр из КоллекцияДанных Цикл
			ОбластьСтрока.Параметры.Заполнить(стр);                         
			сч = 1;                 
			КолВоПрод = Строка(стр.КолВоПрод);
			Для каждого намотка из стр.Серия.бит_ПереченьДлинНаБарабане Цикл
				КолВоПрод = КолВоПрод + Символы.ПС + Символы.ПС + "N" + сч + "(" + намотка.Длина + ")"; 
				сч = сч + 1;
			КонецЦикла;             
			ОбластьСтрока.Параметры.КолВоПрод = КолВоПрод;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			ВсегоНамоток = ВсегоНамоток + стр.Серия.бит_ПереченьДлинНаБарабане.Количество();
		КонецЦикла;
		
		СП.Вставить("КолВоНамоток", ВсегоНамоток); 
		ОбластьПодвал.Параметры.Заполнить(СП);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
						
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	// }}ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:51:40] -
КонецФункции 

#КонецЕсли
